{
  "events": [
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T10:00:00-08:00",
        "endTime": "2023-03-11T11:00:00-08:00"
      },
      "url": "/scale/20x/presentations/keynote-arun-gupta",
      "photo": {
        "alt": null,
        "height": "1364",
        "width": "1500",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/arun.jpg"
      },
      "location": "Ballroom DE",
      "speaker_id": ["10992"],
      "speakers": ["Arun Gupta"],
      "title": "Keynote: Arun Gupta",
      "topic": null,
      "abstract": "The best way for developers to solve the world’s problems is through an open ecosystem that supports their needs. Open innovation, open platforms and horizontal competition offer choice and build trust. An open ecosystem helps lower complexity and improve productivity, portability, and performance so developers can focus on creating innovative solutions. What challenges could you face to build a business case for consuming and contributing to open source? How do you build that culture."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:15:00-08:00",
        "endTime": "2023-03-11T12:00:00-08:00"
      },
      "url": "/scale/20x/presentations/creating-youtube-videos",
      "photo": null,
      "location": "Room 103",
      "speaker_id": ["10979"],
      "speakers": ["Logan Garrison"],
      "title": "Creating YouTube Videos",
      "topic": "Next Generation",
      "abstract": "If you've been thinking about starting a YouTube channel, here you go. Logan has been creating videos for his channel and will share his tips and tricks on planning, shooting, and editing your own videos."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/encapsulating-expertise-building-cross-team-automation",
      "photo": {
        "alt": null,
        "height": "800",
        "width": "735",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/MandiWalls-735x800.jpg"
      },
      "location": "Room 211",
      "speaker_id": ["10557"],
      "speakers": ["Mandi Walls"],
      "title": "Encapsulating Expertise: Building Cross-Team Automation",
      "topic": "Systems and Infrastructure",
      "abstract": "Having a plan for automation is key to succeeding in large, complex environments. Automation can take many forms, from shell scripts to purpose-built tools, but to provide real value it has to be usable by more than just the person who originally wrote it. Personal automation can definitely save time, but sharable automation can free up your whole team, creating a path to self-service tasks throughout your workflows. This talk will discuss features of automation, creating sustainable workflows, and preparing users to adopt automated tasks."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/two-years-200-students-lessons-learned-metas-production-engineering-focused",
      "photo": null,
      "location": "Ballroom B",
      "speaker_id": ["10786"],
      "speakers": ["Andrew Ryan"],
      "title": "Two Years, 200+ Students In: Lessons learned from Meta's Production Engineering-focused pre-internship program",
      "topic": "General",
      "abstract": "In 2021, Meta sponsored its first group of ~100 diverse students in a pre-internship program focused on teaching Production Engineering and SRE skills to undergraduate college students. Using a hands-on curriculum based around Linux and Open Source, our goal was to prepare them for SRE internships or full-time roles at Meta. This year, in 2022, we ran the program again. In this talk, we give an overview of the program, and discuss results from our first two years of teaching SRE to a diverse cohort of college students."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/c-things-you-were-taught-do-wrong",
      "photo": {
        "alt": null,
        "height": null,
        "width": null,
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/img_2686.jpg"
      },
      "location": "Ballroom A",
      "speaker_id": ["4118"],
      "speakers": ["Dustin Laurence"],
      "title": "C++ Things You Were Taught To Do Wrong",
      "topic": "Developer",
      "abstract": "Whether you took a class or taught yourself, it’s likely that you learned some variant of “homework C++”, with the assumption that you would write differently in production code. But how do you learn to do that if it isn’t actually taught? Topics to be covered include using modern tooling, understanding and using smart pointers even with different arenas and custom free() functions, aggressively wrapping ugly or dangerous external interfaces, elementary cache behavior, and designing around high-level synchronization structures such as queues rather than low-level threading primitives."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/symmetric-multiprocessing-smp-freertos-and-raspberry-pi-pico",
      "photo": {
        "alt": null,
        "height": "2839",
        "width": "2839",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_11.jpg"
      },
      "location": "Room 105",
      "speaker_id": ["10764"],
      "speakers": ["Daniel Gross"],
      "title": "Symmetric Multiprocessing (SMP) with FreeRTOS and Raspberry Pi Pico ",
      "topic": "Embedded",
      "abstract": "SMP support in the FreeRTOS Kernel enables one instance of the FreeRTOS kernel to schedule tasks across multiple identical processor cores, which can be helpful for embedded applications in areas like IoT. This session will showcase the FreeRTOS Raspberry Pi Pico port to demonstrate support for SMP in the FreeRTOS Kernel."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/what-edge-native-application",
      "photo": {
        "alt": null,
        "height": "2618",
        "width": "1745",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/fdesbiens-headshot2022-1.jpg"
      },
      "location": "Ballroom G",
      "speaker_id": ["10071"],
      "speakers": ["Frédéric Desbiens"],
      "title": "What is an Edge Native Application?",
      "topic": "Cloud Native",
      "abstract": "Cloud Native; Edge Native. There is only a word of difference, and yet, a world of differences separates those two concepts. The goal of this presentation is to explore what Cloud Native applications and Edge Native applications have in common and what makes Edge Native applications distinct. You will also learn about various runtimes to deploy your edge native applications. While Kubernetes is part of the list, it is far from the only option at your disposal. You will survey some open-source alternatives, which include WebAssembly."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/resf-approach-stable-community-driven-open-source-stewardship",
      "photo": null,
      "location": "Ballroom F",
      "speaker_id": ["10883"],
      "speakers": ["Gregory Kurtzer"],
      "title": "RESF: An Approach to Stable Community Driven Open Source Stewardship",
      "topic": "General",
      "abstract": "A discussion of the model for how open source software foundations can plan for longevity that survives its founders while protecting the community from the whims of political and commercially driven decision making. This session is designed to be both thought-provoking and open to debate. Come prepared to challenge and be challenged, with old assumptions about open source project management on the table."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/deploying-opentelemetry-organizationally-proof-concept-production-scale",
      "photo": {
        "alt": null,
        "height": "4000",
        "width": "6000",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_0944%20%282%29.jpeg"
      },
      "location": "Room 107",
      "speaker_id": ["10971"],
      "speakers": ["Paak Quansah"],
      "title": "Deploying OpenTelemetry Organizationally: From Proof of Concept to In Production at Scale",
      "topic": "Observability",
      "abstract": "Observability is about telling one coherent story about an entire system. Over the years, Pluto TV had to navigate many storytellers in terms of observability vendors, tools, and formats. Recently, our journey to unify the instrumentation, formats, and pipelines we use to standardize and ship telemetry data to multiple vendors culminated in our selection of OpenTelemetry as a potential solution."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/openstatesorg-vc-backed-growth-while-building-open-data-commons",
      "photo": {
        "alt": null,
        "height": "300",
        "width": "300",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/team-headshot-02-small.jpg"
      },
      "location": "Room 106",
      "speaker_id": ["10876"],
      "speakers": ["Jesse Mortenson"],
      "title": "OpenStates.org: VC-backed Growth While Building Open Data for the Commons",
      "topic": "Open Data",
      "abstract": "You’ve heard about the open source core business model. Now, meet the open data core business model! The Open States project, is the best and oldest source for open legislative data and tools in the US. But foundation funding doesn’t last forever… what models can sustain a long-running open data project into the future? \n \n Civic Eagle answered that question by adopting Open States in 2020. But why would a B2B SaaS firm that runs on policy intelligence give away its “moat”? How does a business with an open data core succeed in driving value for both investors and the public good?"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/meet-zeek-extensible-scriptable-network-monitor",
      "photo": null,
      "location": "Room 101",
      "speaker_id": ["10614"],
      "speakers": ["Christian Kreibich"],
      "title": "Meet Zeek, the extensible, scriptable network monitor",
      "topic": "Security",
      "abstract": "Network monitoring is key to understanding your infrastructure, whether that's your home network or a thousand-seat corporate environment. The Zeek network monitor helps you turn the packets in your network into streams of actionable logs, organized around protocols and themes that matter to you. In this talk I'll give an overview of Zeek, its architecture and capabilities, and the broader Zeek project."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/staying-rhelevant-your-home-lab",
      "photo": {
        "alt": null,
        "height": "925",
        "width": "717",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/jscar-headshot-2022%20%281%29.png"
      },
      "location": "Ballroom C",
      "speaker_id": ["10888"],
      "speakers": ["Joshua Loscar"],
      "title": "Staying RHELevant In Your Home Lab.",
      "topic": "FOSS @ HOME",
      "abstract": "This presentation will teach anyone how to use Red Hat's Free developer license to build your Home Lab with up to 16 nodes. You'll learn how to: \n \n \n \n \n \n Create a Red Hat account Download Install Register subscriptions Get started with KVM virtualization on the desktop using cockpit. Secure your environment using Ansible"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T11:30:00-08:00",
        "endTime": "2023-03-11T12:30:00-08:00"
      },
      "url": "/scale/20x/presentations/gateway-api-new-kubernetes-ingress-unifies-load-balancing-and-network",
      "photo": {
        "alt": null,
        "height": "747",
        "width": "498",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Google%20Susan%207.jpeg"
      },
      "location": "Ballroom H",
      "speaker_id": ["10744", "10995"],
      "speakers": ["Susan Wu", "Pierre-Louis Gingembre"],
      "title": "Gateway API: The new Kubernetes Ingress that Unifies Load Balancing and Network Configs",
      "topic": "Cloud Native",
      "abstract": "The Ingress API, the predecessor to the Gateway API, has been limiting, which led to custom implementations and inconsistencies.  With the graduation of the   to beta (July 2022), we’ll discuss the use cases and show a simple demo on how to use the Gateway API and how the setup enables role-oriented behaviors enabling better collaboration between platform admins in Ops and service owners in Dev.  Kubernetes Gateway API"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T12:00:00-08:00",
        "endTime": "2023-03-11T12:45:00-08:00"
      },
      "url": "/scale/20x/presentations/quantum-computing-people-outside-loop",
      "photo": null,
      "location": "Room 103",
      "speaker_id": ["10721"],
      "speakers": ["Wesley Bantugan"],
      "title": "Quantum computing for people outside the loop. ",
      "topic": "Next Generation",
      "abstract": "The holy grail of computing has become this intangible idea of “Quantum Computing.” As this field continues to grow and the possibility of it coming to consumers grows, it becomes more important than ever to understand this mysterious field and its funky quirks. Join Wesley Bantugan as you learn about Qiskit, a quantum computer simulator, to learn how these computers really work without the quantum and algebraic noise."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/lamp-stack-kube-moving-your-old-websites-cloud-without-leaving-chemical",
      "photo": {
        "alt": null,
        "height": "2016",
        "width": "1134",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/davestokes1.jpg"
      },
      "location": "Ballroom G",
      "speaker_id": ["259"],
      "speakers": ["Dave Stokes"],
      "title": "From LAMP Stack to Kube - Moving Your Old Websites into the Cloud Without Leaving Chemical Trails",
      "topic": "Cloud Native",
      "abstract": "The LAMP stack was the internet model for so many years. But now everything is 'cloud this' or 'Kubernetes that'.  But how do you move from LAMP to this new medium, how do the various 'tinker toys' work together, and what tricks does an 'old dog' need to learn to accomplish all this?  So if Kubernetes is in your future but you do not know where to start then you should probably be in this presentation."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/red-teaming-making-sure-no-one-loses",
      "photo": null,
      "location": "Room 101",
      "speaker_id": ["10037"],
      "speakers": ["Greg Prosser"],
      "title": "Red Teaming: Making sure no one loses.",
      "topic": "Security",
      "abstract": "Thinking of your security teams as \"winning\" and \"losing\" when doing Red Team exercises can be a harmful perspective for both sides. A common parable in the security industry is that \"defenders think in lists, attackers think in graphs\". As long as this continues to be true, thinking of your Red Team \"winning\" versus your Blue Team can be demoralizing to your response team, and can lead to a poor approach from your Red Team. In this talk, listen to a former security-focused SRE share perspective they've gained from joining an internal Red Team."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/road-epel-9",
      "photo": {
        "alt": null,
        "height": "400",
        "width": "400",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/carl-2021-square.jpg"
      },
      "location": "Room 211",
      "speaker_id": ["10276"],
      "speakers": ["Carl George"],
      "title": "The Road to EPEL 9",
      "topic": "Systems and Infrastructure",
      "abstract": "EPEL is a yum repo of community maintained packages for use on RHEL and related distributions. Historically, each version of the EPEL repo has launched after the corresponding version of RHEL. For version 9, we were able to flip that around and launch EPEL first. This talk will tell the story of our journey to EPEL 9."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/what-nix-can-do",
      "photo": {
        "alt": null,
        "height": "1264",
        "width": "1264",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/nixlabs-kino-cropped.jpg"
      },
      "location": "Room 105",
      "speaker_id": ["10942"],
      "speakers": ["Matthew Croughan"],
      "title": "What Nix Can Do",
      "topic": "Embedded",
      "abstract": "What is Nix? What is NixOS? You've heard of it, but what does it actually do? The answer is everything. Using Nix, we can reproduce anything, anywhere, any time. Bringing ancient HAM radio packages back from the dead, cross compilation to any foreign architecture, including bootstrapping the compiler itself, isolating packages from each other at runtime, building OCI images, building embedded Linux system images, deployments, you name it. Nix can do it. Some have even taken to calling Nix \"the art of containers without containers\"."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/debugging-developer-way",
      "photo": {
        "alt": null,
        "height": "2048",
        "width": "1476",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7673%203.JPG"
      },
      "location": "Ballroom A",
      "speaker_id": ["10798"],
      "speakers": ["Yarden Laifenfeld"],
      "title": "Debugging, the Developer Way",
      "topic": "Developer",
      "abstract": "As developers, we have many skills we use and constantly improve when writing code. But when it comes to debugging, most of us go for a primarily research-based approach, which means we are leaving the skills we pride ourselves on having as developers behind. This causes the debugging process to be that much harder and more time-consuming than it has to be. In this talk, I will present a different approach to debugging, one that takes advantage of our programming abilities and utilizes them to find bugs faster all while improving our software development and design skills."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/building-observability-collection-service-opentelemetry",
      "photo": {
        "alt": null,
        "height": "681",
        "width": "1024",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/alolita-headshot-0519_0.jpg"
      },
      "location": "Room 107",
      "speaker_id": ["3806"],
      "speakers": ["Alolita Sharma"],
      "title": "Building an observability collection service with OpenTelemetry",
      "topic": "Observability",
      "abstract": "This talk will discuss requirements and design considerations for building a scalable and highly-available observability collection service leveraging OpenTelemetry. Design considerations for service scalability, reliability, performance; telemetry metrics, traces, logs, events support, deployment options will be covered."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/kubernetes-cloud-cost-monitoring-opencost-optimization-strategies",
      "photo": {
        "alt": null,
        "height": "2154",
        "width": "2154",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Chef-Headshots-Sept-Oct-2014%20%2862%20of%20101%29.jpg"
      },
      "location": "Ballroom H",
      "speaker_id": ["3783"],
      "speakers": ["Matt Ray"],
      "title": "Kubernetes Cloud Cost Monitoring with OpenCost & Optimization Strategies",
      "topic": "Cloud Native",
      "abstract": "Understanding the cost and efficiency of Kubernetes is essential once you start expanding your infrastructure with production workloads. The CNCF Sandbox OpenCost project and specification models current and historical Kubernetes cloud spend and resource allocation by service, namespace, labels, and more. This data provides cloud bill transparency which can be used as the basis for optimizing your Kubernetes deployments. Optimizing Kubernetes for cost and performance is an ongoing iterative process that starts with applications and works through the entire stack."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/proaudio-keyboards-scratch",
      "photo": null,
      "location": "Ballroom C",
      "speaker_id": ["4908"],
      "speakers": ["Brian Monroe"],
      "title": "ProAudio Keyboards from Scratch",
      "topic": "FOSS @ HOME",
      "abstract": "More and more musicians are using computers for live performances. You don't need proprietary software and a fancy aluminum body laptop to make it work. We'll go through what's needed to turn your machine into keyboard workstation: \n \n \n \n \n Required and recommended hardware Kernel settings - Scheduling vs using a RealTime kernel.  Audio Connectivity - JACK, Alsa, and PipeWire Apps - Synthisizers vs Samplers.  Finding your own sound - (Creating samples and more)"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/hydra-type-safe-transformations-data-interoperability",
      "photo": {
        "alt": null,
        "height": "629",
        "width": "500",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/2019-05-27%2009.29.44-2%20%281%29.jpg"
      },
      "location": "Room 106",
      "speaker_id": ["10834"],
      "speakers": ["Joshua Shinavier"],
      "title": "Hydra: type-safe transformations for data interoperability",
      "topic": "Open Data",
      "abstract": "Hydra is a data transformation toolkit with its roots in type theory and graph databases. It is the open-source successor to Uber's Dragon toolkit, which tackled the problem of porting data and schemas across language boundaries, enforcing common best practices, and building knowledge graphs. Hydra takes things a bit further in that it is a programming language which embeds in other programming languages, and operates on programs as well as data and schemas. We will take a tour of Hydra from a developer's perspective, emphasizing concrete use cases and workflows."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/learning-big-failures-improve-foss-advocacy-and-adoption",
      "photo": {
        "alt": null,
        "height": "800",
        "width": "800",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bkuhn-photo-2017.jpg"
      },
      "location": "Ballroom F",
      "speaker_id": ["357"],
      "speakers": ["Bradley Kuhn"],
      "title": "Learning From the Big Failures To Improve FOSS Advocacy and Adoption",
      "topic": "General",
      "abstract": "After thirty years of FOSS advocacy, issue and problems in approach have begun to emerge.  Strategic mistakes in response to new technologies has often led to large areas of software endeavor to remain proprietary. While for-profit companies have been rewarded with great efficiency benefits and other perks from their adoption of FOSS, rarely do these benefits trickle down to consumers and end-users in their daily computing lives.  This talk examines our past mistakes in advocacy and activism, and considers what to do next."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:30:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/vox-pupuli-behind-every-successful-open-source-project-vibrant-community",
      "photo": {
        "alt": null,
        "height": "460",
        "width": "460",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bastelfreak.jpeg"
      },
      "location": "Ballroom B",
      "speaker_id": ["10772"],
      "speakers": ["Tim Meusel"],
      "title": "Vox Pupuli - Behind every successful open source project is a vibrant community",
      "topic": "General",
      "abstract": "What happens when critical open source projects stop being maintained? Vox Pupuli is a group of more than 180 puppet module/tooling/documentation authors, all working together to ensure a continuing development process. Our goal is to adopt abandoned FOSS projects from the Puppet ecosystem and to unite lonely FOSS developers. In this talk we will do a deep dive into what Vox Pupuli is, how we build the community and keep it running and why you should participate! We will also discuss how we manage contributions at larger scale."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T13:45:00-08:00",
        "endTime": "2023-03-11T14:30:00-08:00"
      },
      "url": "/scale/20x/presentations/open-source-streaming-jellyfin",
      "photo": {
        "alt": null,
        "height": "3887",
        "width": "2915",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/PRHeadShot.jpg"
      },
      "location": "Room 103",
      "speaker_id": ["10908", "10910", "10909"],
      "speakers": ["Timothy Kidd", "Mikaela Boyon", "Zoe Villanueva"],
      "title": "Open Source Streaming with JellyFin",
      "topic": "Next Generation",
      "abstract": "With the rise of streaming services, the market for affordable digital media has become more in-demand and lucrative. By combining the accessibility of Cloud Computing (AWS/Oracle) and the open source web development of JellyFin, we created a cheap but reliable scalable streaming service that is accesible to all end users. To understand the architecture of streaming services, we must first look into Cloud Computing and understand how Load Balancing/Auto Scaling compliments the integration of JellyFin. We will also cover how to set up accounts for end users."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T14:30:00-08:00",
        "endTime": "2023-03-11T15:15:00-08:00"
      },
      "url": "/scale/20x/presentations/robotics-dummies",
      "photo": null,
      "location": "Room 103",
      "speaker_id": ["10720", "10722"],
      "speakers": ["Samantha Saldana", "Danica Madamba"],
      "title": "Robotics for Dummies",
      "topic": "Next Generation",
      "abstract": "The world is familiar with the multiple paths STEM provides. There's engineering, programming, and design; but who knew there is a division that includes all of these? Robotics, a term for all things robot, allows creativity and imagination to take control. Although applied in the real world, many are unknown of its impact and influence. It may seem intimidating at first, but in reality, all it takes is dedication and willingness! Come listen to Danica and Samantha to learn about the history of robotics, how to make a robot, and how they are applied to everyday life."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/developer-productivity-engineering-open-source-communities",
      "photo": {
        "alt": null,
        "height": "522",
        "width": "916",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/New-headshot-transback-png.png"
      },
      "location": "Ballroom A",
      "speaker_id": ["10128"],
      "speakers": ["Justin Reock"],
      "title": "Developer Productivity Engineering for Open Source Communities",
      "topic": "Developer",
      "abstract": "Just two years ago, IDC predicted that by now 65% of the global GDP will have been digitally transformed. This supports the view that has been espoused that in the 21st century, every successful company will be a software company.  And yet, for many organizations, developer productivity practices have not evolved fast enough to thrive in this world or to simply stay relevant."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/7-years-cgroup-v2-future-linux-resource-control",
      "photo": {
        "alt": null,
        "height": "512",
        "width": "512",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_15.jpg"
      },
      "location": "Room 211",
      "speaker_id": ["10936"],
      "speakers": ["Chris Down"],
      "title": "7 years of cgroup v2: the future of Linux resource control",
      "topic": "Systems and Infrastructure",
      "abstract": "This talk will go into some of the challenges faced in overhauling Linux's resource isolation and control capabilities, and how we've gone about fixing them. This will include some of the most complex and counter-intuitive practical effects we've seen in production, with details of how our expectations and knowledge have developed over the last 5 years using this on over a million machines in production, with insights that are immediately applicable to anyone who runs Linux at scale."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/scalable-and-low-latency-lock-free-data-structures",
      "photo": {
        "alt": null,
        "height": "1020",
        "width": "1107",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/avatar18.jpg"
      },
      "location": "Room 106",
      "speaker_id": ["5189"],
      "speakers": ["Alexander Krizhanovsky"],
      "title": "Scalable and Low Latency Lock-free Data Structures",
      "topic": "Open Data",
      "abstract": "* when standard containers and locking mechanisms aren't enough \n * several advanced data structures: split ordered lists and other variations of lock-free hash tables, tries (partricia trees) and hybrid data structures \n * x86-64 memory ordering and cache hierarchy, operating system preemption and how to employ all the knowledge to implement a very fast data structure \n * gotchas of data structures benchmarking, such as keys distribution, latency vs throughput, worst cases and so on \n * an open source lock-free cache conscius Hash Trie implementation"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/owasp-api-security-top-ten-nutshell",
      "photo": {
        "alt": null,
        "height": "2834",
        "width": "2101",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_4524.jpg"
      },
      "location": "Room 101",
      "speaker_id": ["10896"],
      "speakers": ["Paul Mansour-Geoffrion"],
      "title": "The OWASP API Security Top Ten in a Nutshell",
      "topic": "Security",
      "abstract": "Not familiar with the OWASP API Security top 10? Curious about the state-of-the-art in API security? This list of API vulnerabilities is one every developer should know. In this presentation, we’ll go over the 10 vulnerabilities using examples from real-life or sample applications. Beyond the core points of the Top Ten, we’ll also take a look at: \n - How Cloud Center of Excellence teams can help an organization's infosec. \n - What vulnerability chains are and how they can be prevented. \n - Open source mitigation strategies and how to implement them tl;dr - secure your app logic!"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/building-plant-monitoring-app-influxdb-python-and-flask-edge-cloud",
      "photo": {
        "alt": null,
        "height": "451",
        "width": "450",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/zoe.jpeg"
      },
      "location": "Ballroom C",
      "speaker_id": ["10363"],
      "speakers": ["zoe steinkamp"],
      "title": "Building an Plant Monitoring App with InfluxDB, Python, and Flask with Edge to cloud replication",
      "topic": "FOSS @ HOME",
      "abstract": "The Internet of Things (IoT) is increasingly driven by sensor data, with devices taking measured actions based on everything from wind speed and direction, vital body functions, illumination intensity, and temperature. In this session we will showcase how to build a fully functional sample IoT monitoring application built on the Flask framework and utilizing InfluxDB as its backend. With integrations to visualization libraries such as Plotly, creating automated alerts with InfluxDB as well as data downsampling."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/its-just-website",
      "photo": {
        "alt": null,
        "height": "1200",
        "width": "1200",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/me-boat.jpeg"
      },
      "location": "Ballroom F",
      "speaker_id": ["10941"],
      "speakers": ["Glenn Hope"],
      "title": "\"It's Just A Website\"",
      "topic": "General",
      "abstract": "As companies and products scale, so does their complexity, susceptibility to cascading failures, and value as targets for adversarial entities. This is a talk about the difficulties and dangers of running an application at global scale, and why it takes so many people to do it safely."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/running-batch-workload-k8s-scale",
      "photo": {
        "alt": null,
        "height": "837",
        "width": "837",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/square-profile.png"
      },
      "location": "Ballroom G",
      "speaker_id": ["5910"],
      "speakers": ["Mofizur Rahman"],
      "title": "Running batch workload on K8s at scale",
      "topic": "Cloud Native",
      "abstract": "Kubernetes is great at running containerized workloads and scale. So it can be assumed that it would also be good at running containerized batch workloads. And it is. But there are some other considerations you need to have for running batch workloads on k8s at scale. This talk will give you some guidance on doing just that."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/cat-shaped-hacker-hardware-how-i-created-open-source-business-18",
      "photo": null,
      "location": "Room 105",
      "speaker_id": ["10916"],
      "speakers": ["Alex Lynd"],
      "title": "Cat-Shaped Hacker Hardware: How I Created an Open-Source Business at 18",
      "topic": "Embedded",
      "abstract": "Alex set out to kill the banality in \"educational hardware platforms\" when he created the Nugget: a cat-shaped console for cybersecurity and hardware beginners. He wanted to create an interactive product that would make it fun to learn daunting topics like network security and USB hacking through a cute interface, while also offering utility for seasoned hackers & makers. In this talk, Alex discusses the challenges he faced in bringing a niche educational hardware platform to market, and talks about how he scaled this project into a successful business through open-source design."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/free-software-policy-semi-firm-firmware",
      "photo": {
        "alt": null,
        "height": "500",
        "width": "500",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot4.png"
      },
      "location": "Ballroom B",
      "speaker_id": ["62"],
      "speakers": ["Kyle Rankin"],
      "title": "Free Software Policy with Semi-Firm Firmware",
      "topic": "General",
      "abstract": "Somewhere between hardware and software, is firmware. It was originally called that precisely because it straddled those two worlds. \n \n Yet most firmware is no longer firm, it's more like tofu and exists in firm, semi-firm, and soft states. Current FSF policy that allows proprietary firmware is based on burned-on-chip, write-once firmware from a few decades ago. Most firmware today is field-upgradable and closer to software. This talk will discuss how the modern state of \"firm\"ware demands new free software policy, and start a discussion on what that policy could be."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/we-accidentally-created-serverless-application",
      "photo": {
        "alt": null,
        "height": "200",
        "width": "200",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/810824.jpeg"
      },
      "location": "Ballroom H",
      "speaker_id": ["5691"],
      "speakers": ["JJ Asghar"],
      "title": "We accidentally created a Serverless Application",
      "topic": "Cloud Native",
      "abstract": "In this talk, we will describe our situation, how we ended up with a serverless application by accident. We talk about where we started, our use case, and how it turns out leveraging FaaS and the Code-Engine Serverless platform."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:00:00-08:00",
        "endTime": "2023-03-11T16:00:00-08:00"
      },
      "url": "/scale/20x/presentations/how-take-prometheus-planet-scale-massively-large-scale-metrics-installations",
      "photo": {
        "alt": null,
        "height": "1268",
        "width": "1107",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_14.jpg"
      },
      "location": "Room 107",
      "speaker_id": ["10900"],
      "speakers": ["Vijay Samuel"],
      "title": "How To Take Prometheus Planet Scale - Massively Large Scale Metrics Installations",
      "topic": "Observability",
      "abstract": "Running a metrics platform at scale is not an easy task. Systems like Prometheus offer cloud native monitoring but have their vertical limits. Sharding and clustering allow us to spread the problem out but it isn't infinte. Decentralizing the TSBDs and federating the queries in a smart way is the way to go. In this talk we discover how exactly to do that, what the benefits of going planet scale are and what are the key takeaways from our journey."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T15:30:00-08:00",
        "endTime": "2023-03-11T16:15:00-08:00"
      },
      "url": "/scale/20x/presentations/design-your-dreams",
      "photo": null,
      "location": "Room 103",
      "speaker_id": ["10668", "10669"],
      "speakers": ["Luis Mendoza", "David Martinez"],
      "title": "Design Your Dreams",
      "topic": "Next Generation",
      "abstract": "How are new infraestructure, machinery, and other prototypes designed before production? 3D parametric modeling. As intimidating as it may sound, there is no need to fear. Whether you are an architect, designer, software engineer, or simply someone looking for a hobby, 3D modeling will serve you a purpose. FreeCAD allows you to utilize the creative side of your mind and bring any design into the 3D world. The ability to design is at your fingertips."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:15:00-08:00",
        "endTime": "2023-03-11T17:00:00-08:00"
      },
      "url": "/scale/20x/presentations/redefining-creativity",
      "photo": null,
      "location": "Room 103",
      "speaker_id": ["10671", "10672"],
      "speakers": ["Miejl Mendoza", "Jilliene Yusi"],
      "title": "Redefining Creativity",
      "topic": "Next Generation",
      "abstract": "Today's technology has fundamentally changed the way we make and experience music and art. To show you how music and art is currently being redefined, we present to you, Magenta. Magenta is a research project within Google that is dedicated to connecting the pipeline between machine learning, music, and art. With the development of artificial intelligence that generates songs, images, drawings, etc., it promotes creativity and craftsmanship beyond levels we could have ever imagined."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/identifying-patterns-successful-platform-engineering-setups",
      "photo": null,
      "location": "Ballroom H",
      "speaker_id": ["10928"],
      "speakers": ["Aeris Stewart"],
      "title": "Identifying Patterns in Successful Platform Engineering Setups",
      "topic": "Cloud Native",
      "abstract": "In the last few months, more organizations have shared their platform engineering stories with the community. However, from an individual platform engineer’s perspective, it can be difficult and time-consuming to piece together what all of these stories have in common. As a community manager, I have the privilege to see and analyze many different platform journeys. This talk will share what I’ve learned from months of conversations and research."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/cloud-native-freebsd",
      "photo": null,
      "location": "Ballroom G",
      "speaker_id": ["5999"],
      "speakers": ["Karen Bruner"],
      "title": "Cloud Native FreeBSD",
      "topic": "Cloud Native",
      "abstract": "FreeBSD is a beloved and respected Unix-ish operating system, but it has mostly been left behind in the cloud native revolution. That status is changing rapidly, whether it's the ability to use container runtimes to manage FreeBSD jails, which were containers before Linux containers existed, or to run Linux containers \"natively\" using FreeBSD's Linux binary compatibility. This talk will cover the up-to-date innovations and work by FreeBSD and Kubernetes enthusiasts to make FreeBSD truly \"cloud native.\""
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/how-do-you-trust-your-open-source-software",
      "photo": {
        "alt": null,
        "height": "1280",
        "width": "1176",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/naveensrinivasan.jpeg"
      },
      "location": "Room 101",
      "speaker_id": ["10615", "10682"],
      "speakers": ["Naveen Srinivasan", "Brian Russell"],
      "title": "How do you trust your open source software?",
      "topic": "Security",
      "abstract": "The OpenSSF Scorecard is an automated tool that assesses several important heuristics associated with software security and assigns each check a score of 0-10. Projects like  , , and use Scorecard. Eclipse Foundation enoyproxy tensorflow"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/everyone-should-own-their-data",
      "photo": {
        "alt": null,
        "height": "960",
        "width": "540",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/20170605_133411.jpg"
      },
      "location": "Room 106",
      "speaker_id": ["5954"],
      "speakers": ["Sam Hanna"],
      "title": "Everyone Should Own Their Data",
      "topic": "Open Data",
      "abstract": "Companies like Google and Apple are making it hard for us to trust them, such as scanning our photos, emails, and files. Using our data to sell to advertisers and injecting advertisments into internet experience. With the rise of private services that are inpeding on our privacy has driven us to find other means of storing our data. Join this Session as we discuss ways to get away from depending on private companies and learn to host your own data server easily and cost efficient."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/death-hardware-knowledge",
      "photo": {
        "alt": null,
        "height": "400",
        "width": "400",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/Julia-400x400.png"
      },
      "location": "Ballroom F",
      "speaker_id": ["10659", "10660"],
      "speakers": ["Julia Kreger", "Jay Faulkner"],
      "title": "The death of hardware knowledge",
      "topic": "General",
      "abstract": "As we have simplified technology, we have abstracted away details. As time has passed, the bulk of the interaction has moved to the simplified interactions. They became the preference due to speed, efficiency, and economics. Yet much is still constrained in the lower layers. We need the context to make informed decisions. We'll talk about the trend, and what to be mindful of as we continue to simplify technology."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/level-copilot",
      "photo": {
        "alt": null,
        "height": "406",
        "width": "406",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/1551287106903.jpeg"
      },
      "location": "Ballroom A",
      "speaker_id": ["10946"],
      "speakers": ["Rizel Scarlett"],
      "title": "Level up with Copilot",
      "topic": "Developer",
      "abstract": "If you’ve tried GitHub Copilot, you know that it can feel like magic. The tool fills out entire blocks of code with shocking accuracy—though knowing exactly where to correct it requires skill. In this session, Rizèl Scarlett shares how GitHub Copilot can help you level up your software engineering career."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/brief-introduction-mastodon-and-fediverse",
      "photo": {
        "alt": null,
        "height": "640",
        "width": "413",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/bmurphy.jpg"
      },
      "location": "Ballroom B",
      "speaker_id": ["5172"],
      "speakers": ["Bob Murphy"],
      "title": "A brief introduction to Mastodon and the Fediverse.",
      "topic": "General",
      "abstract": "The Fediverse is a collection of communities that is a bit of a throwback to a smaller, more personal time on the internet.  There are services for short messaging, audio and video sharing, and event organizing, among other things.   Explore how you might wish to join into the rich, new world that has more of a resemblance of the internet as it was envisioned to be."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/call-reprised-and-rejuvenated",
      "photo": {
        "alt": null,
        "height": "1000",
        "width": "1000",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/metacotank-sm.png"
      },
      "location": "Room 211",
      "speaker_id": ["5977"],
      "speakers": ["Matt Davis"],
      "title": "On-Call Reprised and Rejuvenated",
      "topic": "Systems and Infrastructure",
      "abstract": "Being On-Call in software is not as clearly defined as other industries. The start-up nature of things has led to companies implementing emergency Call in myriad ways, because there are advantages to picking what works for your small org with little-to-few IT/Ops staff. Blameless was such a company once upon a time, with SRE making up most of a single monolithic rotation for anything that went wrong. To keep up with scaling the operation, we worked many months to introspect how we could repair our painful rotation and implement continuous improvement, while making On-Call less painful."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/home-labs-fun-and-profit",
      "photo": {
        "alt": null,
        "height": "960",
        "width": "958",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/k_nerd.jpg"
      },
      "location": "Ballroom C",
      "speaker_id": ["10915"],
      "speakers": ["Kat Fitzgerald"],
      "title": "Home Labs for fun and !profit",
      "topic": "FOSS @ HOME",
      "abstract": "There've been dozens (100s?) of talks on building home labs. Let's do it on a shoestring budget, with the most flexibility WITHOUT doubling your electric bill.  You'll learn to create/manage from a primary server, multiple Linux distributions, including RaspberryPIs. How to quickly setup k8s clusters (and tear thhem down) and simple ways to build in security testing.  Key takeaways: \n \n \n \n \n \n Hdw SFW Mgmt Distros Clusters Security All this and Dancing Flamingos? Wow! What a deal!!"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T16:30:00-08:00",
        "endTime": "2023-03-11T17:30:00-08:00"
      },
      "url": "/scale/20x/presentations/declutter-your-performance-metrics-supercharge-your-web-page",
      "photo": {
        "alt": null,
        "height": "600",
        "width": "600",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_2712_exif_clerared_low_ressed_resized_cloaked.png"
      },
      "location": "Room 107",
      "speaker_id": ["10755"],
      "speakers": ["Chanchal Gupta"],
      "title": "Declutter your performance metrics to supercharge your web page",
      "topic": "Observability",
      "abstract": "Today, modern APMs provide great visibility into application / web page performance, however, with limited time and resources it can be confusing as to which metric(s) will provide the best results for a business and its customers. We will share an approach to help cut through “paralysis through analysis” and choose the most important metrics and their optimal thresholds to achieve organizational results. This approach can help provide some guidance on correlating performance to business metrics like bounced sessions, conversion rates, search engine rankings, etc."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/defining-open-source-ai",
      "photo": {
        "alt": null,
        "height": "2128",
        "width": "2184",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/ace_085c-x.jpg"
      },
      "location": "Ballroom F",
      "speaker_id": ["5647"],
      "speakers": ["Stefano Maffulli"],
      "title": "Defining an Open Source AI",
      "topic": "General",
      "abstract": "Participants will be invited to participate in a thought-provoking discussion about a seismic shift facing open source today: What characteristics should an Open Source AI have?"
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/kittens-and-control",
      "photo": {
        "alt": null,
        "height": null,
        "width": null,
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headcrop.jpg"
      },
      "location": "Ballroom B",
      "speaker_id": ["4046"],
      "speakers": ["Jos Poortvliet"],
      "title": "Kittens and control",
      "topic": "General",
      "abstract": "In a world where speech depends on software, free speech depends on free software. Or: in a world where billionaires control our social, work and communication platforms, maybe we need to pay attention. In this kitten-laced presentation I'll make the case for worries about privacy and how open source & decentralization can fix it. Will I mention Musk and twitter? You bet. Also, Facebook, Tik Tok, and Twitter. And tons of cool, open source, decentralized alternatives from all over. Like Nextcloud (ask me anything!) but also Mastodon, Peertube, Matrix and more."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/applying-sre-principles-cicd",
      "photo": {
        "alt": null,
        "height": "2544",
        "width": "2133",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/mel_profile_pic.jpeg"
      },
      "location": "Room 211",
      "speaker_id": ["10651"],
      "speakers": ["Mel Kaulfuss"],
      "title": "Applying SRE principles to CI/CD",
      "topic": "Systems and Infrastructure",
      "abstract": "Automation of building & testing code with CI/CD enables us to ship code frequently with a high level of trust that bugs won’t impact end-users. Why though, is CI/CD still so painfully slow, unreliable, and our ability to deliver frequently blocked?  Look at CI/CD with an SRE lens, understand how to set meaningful SLIs, SLOs, & error budgets to tune test suites & pipelines to reclaim control over large, slow and unreliable build and deploy processes."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/live-coding-ebpf-metalens",
      "photo": null,
      "location": "Room 107",
      "speaker_id": ["10820"],
      "speakers": ["Nikita Baksalyar"],
      "title": "Live Coding eBPF with Metalens",
      "topic": "Observability",
      "abstract": "eBPF is a powerful technology that makes the Linux kernel programmable and observable. This gives us magical powers of understanding complex systems behavior without compromising on security and performance. But there is a catch: eBPF is complex. To build your own tools using eBPF, you need to know a lot about the intricacies of low-level programming. In this talk, we will learn more about the powers that eBPF gives developers. We will discuss how we can use visual programming concepts to make building eBPF programs more simple, intuitive and accessible."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/maintaining-and-contributing-code-easier-devcontainers",
      "photo": {
        "alt": null,
        "height": "3024",
        "width": "3024",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_7167.jpeg"
      },
      "location": "Ballroom A",
      "speaker_id": ["9831"],
      "speakers": ["Jay Miller"],
      "title": "Maintaining and Contributing Code Easier with Devcontainers",
      "topic": "Developer",
      "abstract": "It's easier than to develop open source projects in a rich world of packages, modules, and tools. But this isn't always great. Maintainers are challenged with making their projects easy for them to manage while also ensuring that folks have all the necessary tools needed for developers of a wide range of skill levels. Devcontainers are a great way to take your development environment and make it replicatable for contributors but locally and via the web. This talk looks at how to develop devcontainers of varying complexities so contributors have everything they need to submit that next PR."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/data-security-and-storage-hardening-rook-and-ceph",
      "photo": {
        "alt": null,
        "height": null,
        "width": null,
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/F2%20Hedcut%20by%20Kevin%20Sprouls%20.jpg"
      },
      "location": "Room 101",
      "speaker_id": ["477", "10098", "10099"],
      "speakers": ["Federico Lucifredi", "Ana McTaggart", "Michael Hackett"],
      "title": "Data Security and Storage Hardening in Rook and Ceph",
      "topic": "Security",
      "abstract": "We explore the security model exposed by Rook with Ceph, the leading software-defined storage platform of the Open Source world. Digging increasingly deeper in the stack, we examine hardening options for Ceph storage appropriate for a variety of threat profiles."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/introduction-nextcloud-your-data-your-cloud",
      "photo": null,
      "location": "Room 106",
      "speaker_id": ["498"],
      "speakers": ["der hans"],
      "title": "Introduction to Nextcloud: Your data, your cloud",
      "topic": "Open Data",
      "abstract": "Nextcloud is your private cloud. \n \nYour data, your cloud. Nextcloud joined the Fediverse with ActivityPub integration. Use Nextcloud for private, secure cloud features such as collaboration tools, file sync and phone sync. In addition to the Nextcloud Talk for video calls it integrates with Big Blue Button for full classroom and meeting style video conferencing. Nextcloud was created to be Free Software. \n \nUsing the copyleft AGPL helps ensure it will remain Free in the future. Be your own cloud with web forms, project management, password management and collaborative office suite."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/year-linux-headset-arvr-stardust-xr",
      "photo": {
        "alt": null,
        "height": "4608",
        "width": "3456",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/IMG_20200606_150727%20%282020_06_06%2021_01_58%20UTC%29.jpg"
      },
      "location": "Ballroom C",
      "speaker_id": ["1129"],
      "speakers": ["Nova King"],
      "title": "Year of the Linux Headset? AR/VR with Stardust XR",
      "topic": "FOSS @ HOME",
      "abstract": "Augmented and Virtual Reality are finally becoming practical, but the existing headsets don't do much. This technology has been promised to revolutionize our lives, but some of the biggest forces holding it back are the legacy of old inflexible operating systems and UI design. We can do better. So in this talk I'll explain why Linux and open source in general can do better than the other available options. We have most of the pieces of the FOSS XR ecosystem to make really compelling spatial computers such as my project, Stardust XR, as a new system UI made from scratch for 3D."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/using-webassembly-now-its-easier-you-think",
      "photo": {
        "alt": null,
        "height": "1600",
        "width": "2400",
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/headshot_kubecon.jpg"
      },
      "location": "Ballroom H",
      "speaker_id": ["10771", "10781"],
      "speakers": ["Brooks Townsend", "Taylor Thomas"],
      "title": "Using WebAssembly Now: It's Easier Than You Think",
      "topic": "Cloud Native",
      "abstract": "WebAssembly has come a long way in the past few years in the cloud native ecosystem. Real-world applications are possible, and powerful, and better yet it works great with existing technologies. This talk is a demo-heavy and practical showcase of WebAssembly's strengths and limitations when it comes to running a highly distributed application."
    },
    {
      "when": {
        "day": "Saturday",
        "startTime": "2023-03-11T18:00:00-08:00",
        "endTime": "2023-03-11T19:00:00-08:00"
      },
      "url": "/scale/20x/presentations/lessons-learned-7-years-running-developer-platforms",
      "photo": {
        "alt": null,
        "height": null,
        "width": null,
        "src": "https://www.socallinuxexpo.org/sites/default/files/speakers/9606152719_c2659a40c9_b.jpg"
      },
      "location": "Ballroom G",
      "speaker_id": ["4930"],
      "speakers": ["Michael Coté"],
      "title": "Lessons learned from 7 years of running developer platforms",
      "topic": "Cloud Native",
      "abstract": "People are coming at you to get kubernetes up and running and then build some kind of platform on-top of kubernetes. Getting kubernetes ready for developers may be a new problem, but building and running developer platforms has been going on for at least 10 years. This talk will cover the lessons those organizations have learned such as: product managing, attracting and retaining developers, seeding trust and skills, re-skilling existing ops staff, etc."
    }
  ]
}
